GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F46Q71.inc
;----- PORTWIN4 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'
IN4              EQU  H'0004'
IN5              EQU  H'0005'
IN6              EQU  H'0006'
IN7              EQU  H'0007'


;----- PORTWIN5 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'
IN4              EQU  H'0004'
IN5              EQU  H'0005'
IN6              EQU  H'0006'
IN7              EQU  H'0007'


;----- PORTWIN6 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'
IN4              EQU  H'0004'
IN5              EQU  H'0005'
IN6              EQU  H'0006'
IN7              EQU  H'0007'


;----- PORTWIN7 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'
IN4              EQU  H'0004'
IN5              EQU  H'0005'
IN6              EQU  H'0006'
IN7              EQU  H'0007'


;----- PORTWCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'


;----- PORTWDF Bits -----------------------------------------------------
DF0              EQU  H'0000'
DF1              EQU  H'0001'
DF2              EQU  H'0002'
DF3              EQU  H'0003'
DF4              EQU  H'0004'
DF5              EQU  H'0005'
DF6              EQU  H'0006'
DF7              EQU  H'0007'
PWDF0            EQU  H'0000'
PWDF1            EQU  H'0001'
PWDF2            EQU  H'0002'
PWDF3            EQU  H'0003'
PWDF4            EQU  H'0004'
PWDF5            EQU  H'0005'
PWDF6            EQU  H'0006'
PWDF7            EQU  H'0007'


;----- VPORTCON Bits -----------------------------------------------------
PWCLKEN          EQU  H'0000'


;----- ADCGA Bits -----------------------------------------------------
CGA0             EQU  H'0000'
CGA1             EQU  H'0001'
CGA2             EQU  H'0002'
CGA3             EQU  H'0003'
CGA4             EQU  H'0004'
CGA5             EQU  H'0005'
CGA6             EQU  H'0006'
CGA7             EQU  H'0007'
ADCGA0           EQU  H'0000'
ADCGA1           EQU  H'0001'
ADCGA2           EQU  H'0002'
ADCGA3           EQU  H'0003'
ADCGA4           EQU  H'0004'
ADCGA5           EQU  H'0005'
ADCGA6           EQU  H'0006'
ADCGA7           EQU  H'0007'


;----- ADCGB Bits -----------------------------------------------------
CGB0             EQU  H'0000'
CGB1             EQU  H'0001'
CGB2             EQU  H'0002'
CGB3             EQU  H'0003'
CGB4             EQU  H'0004'
CGB5             EQU  H'0005'
CGB6             EQU  H'0006'
CGB7             EQU  H'0007'
ADCGB0           EQU  H'0000'
ADCGB1           EQU  H'0001'
ADCGB2           EQU  H'0002'
ADCGB3           EQU  H'0003'
ADCGB4           EQU  H'0004'
ADCGB5           EQU  H'0005'
ADCGB6           EQU  H'0006'
ADCGB7           EQU  H'0007'


;----- ADCGC Bits -----------------------------------------------------
CGC0             EQU  H'0000'
CGC1             EQU  H'0001'
CGC2             EQU  H'0002'
CGC3             EQU  H'0003'
CGC4             EQU  H'0004'
CGC5             EQU  H'0005'
CGC6             EQU  H'0006'
CGC7             EQU  H'0007'
ADCGC0           EQU  H'0000'
ADCGC1           EQU  H'0001'
ADCGC2           EQU  H'0002'
ADCGC3           EQU  H'0003'
ADCGC4           EQU  H'0004'
ADCGC5           EQU  H'0005'
ADCGC6           EQU  H'0006'
ADCGC7           EQU  H'0007'


;----- ADCGD Bits -----------------------------------------------------
CGD0             EQU  H'0000'
CGD1             EQU  H'0001'
CGD2             EQU  H'0002'
CGD3             EQU  H'0003'
CGD4             EQU  H'0004'
CGD5             EQU  H'0005'
CGD6             EQU  H'0006'
CGD7             EQU  H'0007'
ADCGD0           EQU  H'0000'
ADCGD1           EQU  H'0001'
ADCGD2           EQU  H'0002'
ADCGD3           EQU  H'0003'
ADCGD4           EQU  H'0004'
ADCGD5           EQU  H'0005'
ADCGD6           EQU  H'0006'
ADCGD7           EQU  H'0007'


;----- ADCGE Bits -----------------------------------------------------
CGE0             EQU  H'0000'
CGE1             EQU  H'0001'
CGE2             EQU  H'0002'
ADCGE0           EQU  H'0000'
ADCGE1           EQU  H'0001'
ADCGE2           EQU  H'0002'


;----- OPA1CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
CPON_OPA1CON0    EQU  H'0005'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA1UG           EQU  H'0003'
OPA1CPON         EQU  H'0005'
OPA1EN           EQU  H'0007'


;----- OPA1CON1 Bits -----------------------------------------------------
RESON            EQU  H'0003'
NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
NSS2             EQU  H'0002'
GSEL0            EQU  H'0004'
GSEL1            EQU  H'0005'
GSEL2            EQU  H'0006'
OPA1RESON        EQU  H'0003'
OPA1NSS0         EQU  H'0000'
OPA1NSS1         EQU  H'0001'
OPA1NSS2         EQU  H'0002'
OPA1GSEL0        EQU  H'0004'
OPA1GSEL1        EQU  H'0005'
OPA1GSEL2        EQU  H'0006'


;----- OPA1CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
NCH0_OPA1CON2    EQU  H'0004'
NCH1_OPA1CON2    EQU  H'0005'
NCH2_OPA1CON2    EQU  H'0006'
OPA1PCH0         EQU  H'0000'
OPA1PCH1         EQU  H'0001'
OPA1PCH2         EQU  H'0002'
OPA1NCH0         EQU  H'0004'
OPA1NCH1         EQU  H'0005'
OPA1NCH2         EQU  H'0006'


;----- OPA1CON3 Bits -----------------------------------------------------
INTOE            EQU  H'0005'
PSS0_OPA1CON3    EQU  H'0000'
PSS1_OPA1CON3    EQU  H'0001'
PSS2             EQU  H'0002'
PSS3             EQU  H'0003'
PSS4             EQU  H'0004'
FMS0             EQU  H'0006'
FMS1             EQU  H'0007'
OPA1INTOE        EQU  H'0005'
OPA1PSS0         EQU  H'0000'
OPA1PSS1         EQU  H'0001'
OPA1PSS2         EQU  H'0002'
OPA1PSS3         EQU  H'0003'
OPA1PSS4         EQU  H'0004'
OPA1FMS0         EQU  H'0006'
OPA1FMS1         EQU  H'0007'


