GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F46Q71.inc
;----- TU16APRH Bits -----------------------------------------------------
PRH0             EQU  H'0000'
PRH1             EQU  H'0001'
PRH2             EQU  H'0002'
PRH3             EQU  H'0003'
PRH4             EQU  H'0004'
PRH5             EQU  H'0005'
PRH6             EQU  H'0006'
PRH7             EQU  H'0007'
TU16APRH0        EQU  H'0000'
TU16APRH1        EQU  H'0001'
TU16APRH2        EQU  H'0002'
TU16APRH3        EQU  H'0003'
TU16APRH4        EQU  H'0004'
TU16APRH5        EQU  H'0005'
TU16APRH6        EQU  H'0006'
TU16APRH7        EQU  H'0007'
TU16APR8         EQU  H'0000'
TU16APR9         EQU  H'0001'
TU16APR10        EQU  H'0002'
TU16APR11        EQU  H'0003'
TU16APR12        EQU  H'0004'
TU16APR13        EQU  H'0005'
TU16APR14        EQU  H'0006'
TU16APR15        EQU  H'0007'


;----- TU16ACLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'
TU16ACLK0        EQU  H'0000'
TU16ACLK1        EQU  H'0001'
TU16ACLK2        EQU  H'0002'
TU16ACLK3        EQU  H'0003'
TU16ACLK4        EQU  H'0004'
TU16ACLK5        EQU  H'0005'
TU16ACLK6        EQU  H'0006'
TU16ACLK7        EQU  H'0007'


;----- TU16AERS Bits -----------------------------------------------------
ERS0             EQU  H'0000'
ERS1             EQU  H'0001'
ERS2             EQU  H'0002'
ERS3             EQU  H'0003'
ERS4             EQU  H'0004'
ERS5             EQU  H'0005'
ERS6             EQU  H'0006'
ERS7             EQU  H'0007'
TU16AERS0        EQU  H'0000'
TU16AERS1        EQU  H'0001'
TU16AERS2        EQU  H'0002'
TU16AERS3        EQU  H'0003'
TU16AERS4        EQU  H'0004'
TU16AERS5        EQU  H'0005'
TU16AERS6        EQU  H'0006'
TU16AERS7        EQU  H'0007'


;----- TU16BCON0 Bits -----------------------------------------------------
CIE              EQU  H'0000'
ZIE              EQU  H'0001'
PRIE             EQU  H'0002'
RDSEL            EQU  H'0003'
OPOL             EQU  H'0004'
OM               EQU  H'0005'
CPOL             EQU  H'0006'
ON_TU16BCON0     EQU  H'0007'
TU16BCIE         EQU  H'0000'
TU16BZIE         EQU  H'0001'
TU16BPRIE        EQU  H'0002'
TU16BRDSEL       EQU  H'0003'
TU16BOPOL        EQU  H'0004'
TU16BOM          EQU  H'0005'
TU16BCPOL        EQU  H'0006'
TU16BON          EQU  H'0007'


;----- TU16BCON1 Bits -----------------------------------------------------
CIF              EQU  H'0000'
ZIF              EQU  H'0001'
PRIF             EQU  H'0002'
CAPT             EQU  H'0003'
LIMIT            EQU  H'0004'
CLR              EQU  H'0005'
OSEN             EQU  H'0006'
RUN              EQU  H'0007'
TU16BCIF         EQU  H'0000'
TU16BZIF         EQU  H'0001'
TU16BPRIF        EQU  H'0002'
TU16BCAPT        EQU  H'0003'
TU16BLIMIT       EQU  H'0004'
TU16BCLR         EQU  H'0005'
TMRBOSEN         EQU  H'0006'
TU16BRUN         EQU  H'0007'


;----- TU16BHLT Bits -----------------------------------------------------
STOP0            EQU  H'0000'
STOP1            EQU  H'0001'
RESET0           EQU  H'0002'
RESET1           EQU  H'0003'
START0           EQU  H'0004'
START1           EQU  H'0005'
TU16BSTOP0       EQU  H'0000'
TU16BSTOP1       EQU  H'0001'
TU16BRESET0      EQU  H'0002'
TU16BRESET1      EQU  H'0003'
TU16BSTART0      EQU  H'0004'
TU16BSTART1      EQU  H'0005'


;----- TU16BPS Bits -----------------------------------------------------
PS0              EQU  H'0000'
PS1              EQU  H'0001'
PS2              EQU  H'0002'
PS3              EQU  H'0003'
PS4              EQU  H'0004'
PS5              EQU  H'0005'
TU16BPS0         EQU  H'0000'
TU16BPS1         EQU  H'0001'
TU16BPS2         EQU  H'0002'
TU16BPS3         EQU  H'0003'
TU16BPS4         EQU  H'0004'
TU16BPS5         EQU  H'0005'


;----- TU16BTMR Bits -----------------------------------------------------
TMRL0            EQU  H'0000'
TMRL1            EQU  H'0001'
TMRL2            EQU  H'0002'
TMRL3            EQU  H'0003'
TMRL4            EQU  H'0004'
TMRL5            EQU  H'0005'
TMRL6            EQU  H'0006'
TMRL7            EQU  H'0007'
TU16BTMRL0       EQU  H'0000'
TU16BTMRL1       EQU  H'0001'
TU16BTMRL2       EQU  H'0002'
TU16BTMRL3       EQU  H'0003'
TU16BTMRL4       EQU  H'0004'
TU16BTMRL5       EQU  H'0005'
TU16BTMRL6       EQU  H'0006'
TU16BTMRL7       EQU  H'0007'
TU16BTMR0        EQU  H'0000'
TU16BTMR1        EQU  H'0001'
TU16BTMR2        EQU  H'0002'
TU16BTMR3        EQU  H'0003'
TU16BTMR4        EQU  H'0004'
TU16BTMR5        EQU  H'0005'
TU16BTMR6        EQU  H'0006'
TU16BTMR7        EQU  H'0007'
CRL0             EQU  H'0000'
CRL1             EQU  H'0001'
CRL2             EQU  H'0002'
CRL3             EQU  H'0003'
CRL4             EQU  H'0004'
CRL5             EQU  H'0005'
CRL6             EQU  H'0006'
CRL7             EQU  H'0007'
TU16BCRL0        EQU  H'0000'
TU16BCRL1        EQU  H'0001'
TU16BCRL2        EQU  H'0002'
TU16BCRL3        EQU  H'0003'
TU16BCRL4        EQU  H'0004'
TU16BCRL5        EQU  H'0005'
TU16BCRL6        EQU  H'0006'
TU16BCRL7        EQU  H'0007'
TU16BCR0         EQU  H'0000'
TU16BCR1         EQU  H'0001'
TU16BCR2         EQU  H'0002'
TU16BCR3         EQU  H'0003'
TU16BCR4         EQU  H'0004'
TU16BCR5         EQU  H'0005'
TU16BCR6         EQU  H'0006'
TU16BCR7         EQU  H'0007'


;----- TU16BTMRH Bits -----------------------------------------------------
TMRH0            EQU  H'0000'
TMRH1            EQU  H'0001'
TMRH2            EQU  H'0002'
TMRH3            EQU  H'0003'
TMRH4            EQU  H'0004'
TMRH5            EQU  H'0005'
TMRH6            EQU  H'0006'
TMRH7            EQU  H'0007'
TU16BTMRH0       EQU  H'0000'
TU16BTMRH1       EQU  H'0001'
TU16BTMRH2       EQU  H'0002'
TU16BTMRH3       EQU  H'0003'
TU16BTMRH4       EQU  H'0004'
TU16BTMRH5       EQU  H'0005'
TU16BTMRH6       EQU  H'0006'
TU16BTMRH7       EQU  H'0007'
TU16BTMR8        EQU  H'0000'
TU16BTMR9        EQU  H'0001'
TU16BTMR10       EQU  H'0002'
TU16BTMR11       EQU  H'0003'
TU16BTMR12       EQU  H'0004'
TU16BTMR13       EQU  H'0005'
TU16BTMR14       EQU  H'0006'
TU16BTMR15       EQU  H'0007'
CRH0             EQU  H'0000'
CRH1             EQU  H'0001'
CRH2             EQU  H'0002'
CRH3             EQU  H'0003'
CRH4             EQU  H'0004'
CRH5             EQU  H'0005'
CRH6             EQU  H'0006'
CRH7             EQU  H'0007'
TU16BCRH0        EQU  H'0000'
TU16BCRH1        EQU  H'0001'
TU16BCRH2        EQU  H'0002'
TU16BCRH3        EQU  H'0003'
TU16BCRH4        EQU  H'0004'
TU16BCRH5        EQU  H'0005'
TU16BCRH6        EQU  H'0006'
TU16BCRH7        EQU  H'0007'
TU16BCR8         EQU  H'0000'
TU16BCR9         EQU  H'0001'
TU16BCR10        EQU  H'0002'
TU16BCR11        EQU  H'0003'
TU16BCR12        EQU  H'0004'
TU16BCR13        EQU  H'0005'
TU16BCR14        EQU  H'0006'
TU16BCR15        EQU  H'0007'


;----- TU16BPR Bits -----------------------------------------------------
PRL0             EQU  H'0000'
PRL1             EQU  H'0001'
PRL2             EQU  H'0002'
PRL3             EQU  H'0003'
PRL4             EQU  H'0004'
PRL5             EQU  H'0005'
PRL6             EQU  H'0006'
PRL7             EQU  H'0007'
TU16BPRL0        EQU  H'0000'
TU16BPRL1        EQU  H'0001'
TU16BPRL2        EQU  H'0002'
TU16BPRL3        EQU  H'0003'
TU16BPRL4        EQU  H'0004'
TU16BPRL5        EQU  H'0005'
TU16BPRL6        EQU  H'0006'
TU16BPRL7        EQU  H'0007'
TU16BPR0         EQU  H'0000'
TU16BPR1         EQU  H'0001'
TU16BPR2         EQU  H'0002'
TU16BPR3         EQU  H'0003'
TU16BPR4         EQU  H'0004'
TU16BPR5         EQU  H'0005'
TU16BPR6         EQU  H'0006'
TU16BPR7         EQU  H'0007'


